Revit 2024 API
ElementRecord.GetBoundingBox Method
 Gets the bounding box of the element record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Outline GetBoundingBox()
Visual Basic
Public Function GetBoundingBox As Outline
Visual C++
public:
Outline^ GetBoundingBox()
Return Value
 The bounding box outline. null if there is no bounding box for this element.
See Also
ElementRecord Class
Autodesk.Revit.DB Namespace